
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 7 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * module.rpts-database-v11.azurerm_postgresql_server.postgres-paas
* Replace
  * azurerm_application_insights.appinsights


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights must be replaced
-/+ resource "azurerm_application_insights" "appinsights" {
      ~ app_id                                = "0183eae4-2a4d-44ef-900f-823fc4d54f08" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-api-aat/providers/Microsoft.Insights/components/rpts-api-appinsights-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "westeurope" -> "uksouth" # forces replacement
        name                                  = "rpts-api-appinsights-aat"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/rpts-api.git" -> null
            "application"         = "residential-property-tribunals"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://rpts-aat.vault.azure.net/secrets/app-insights-connection-string/382171cf344b40a2b41c652e5f648a58"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-10-10T15:16:31Z" -> (known after apply)
        id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-DATABASE/7a734a9430384d5e89e7fb31f1149ba9"
        name                    = "api-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-10-10T15:16:31Z" -> (known after apply)
        id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-HOST/0d328fc5e06d491bb81637e36bd1db2e"
        name                    = "api-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-10-10T15:16:31Z" -> (known after apply)
        id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-PASS/bc00cc5025ec4b44a694fba226f4b866"
        name                    = "api-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-10-10T15:16:31Z" -> (known after apply)
        id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-PORT/065310f686644ab9ac768f6f97bb6b59"
        name                    = "api-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-10-10T15:16:31Z" -> (known after apply)
        id                      = "https://rpts-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-USER/8b501afce82c4f7dbd4c7a95bcab3a94"
        name                    = "api-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
            "source"              = "api PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # module.rpts-database-v11.azurerm_postgresql_server.postgres-paas will be updated in-place
  ~ resource "azurerm_postgresql_server" "postgres-paas" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpts-api-postgres-db-v11-data-aat/providers/Microsoft.DBforPostgreSQL/servers/rpts-api-postgres-db-v11-aat"
        name                              = "rpts-api-postgres-db-v11-aat"
        tags                              = {
            "application"         = "residential-property-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpts-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Residential Property Tribunals"
        }
        # (16 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }
    }

Plan: 1 to add, 7 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":32,"Program":"tfcmt","SHA1":"","Vars":{}} -->